{"type": "FeatureCollection", "features": [{"type": "Feature", "properties": {"id": 33, "title": "CHICAGO MUSICIAN MARCH FOR EQUALITY & CHANGE", "time_info": "Sunday, June 21 2020 at 10:00 AM", "latitude": "41.8781", "longitude": "-87.6298", "location": "Lincoln Park to Wicker Park, Chicago", "url": "https://www.protestchicago.com/2020/06/12/chicago-musician-march-for-equality-change/", "notes": "Join Chicago musicians, industry workers and friends of the Chicago music community, as they lead a peaceful (non-violent) protest march in support of Black Lives Matter and demand justice for victims of police brutality and excessive force. The march will begin gathering at 9:30AM in Lincoln Park at Julia Porter Park- the six corner intersection of Fullerton / Lincoln / Halsted, we will start walking at 10AM, and end at the six corner intersection of North / Milwaukee / Damen in Wicker Park.", "epoch_time": 1592733600}, "geometry": {"type": "Point", "coordinates": [-87.6298, 41.8781]}}, {"type": "Feature", "properties": {"id": 32, "title": "Shift Chicago March/Gathering", "time_info": "Saturday, June 20 2020 at 11:00 AM", "latitude": "41.8781136", "longitude": "-87.6297982", "location": "Chicago, Illinois", "url": "https://www.protestchicago.com/2020/06/12/shift-chicago-march-gathering/", "notes": "Join thousands of individuals on June 20th, 2020 from around the Chicagoland area as take to the streets and let our voices be heard. Our objective is to voice our concerns, demand reconstruction in our justice system, educate others, love one another, contact legislators, and propose legislature. Remember this will be a peaceful march. Let’s make a change for our city!", "epoch_time": 1592650800}, "geometry": {"type": "Point", "coordinates": [-87.6297982, 41.8781136]}}, {"type": "Feature", "properties": {"id": 31, "title": "March For US 2020 – Million Man March, Chicago", "time_info": "Friday, June 19 2020 at 11:00 AM", "latitude": "41.8781136", "longitude": "-87.6297982", "location": "Chicago, IL", "url": "https://www.protestchicago.com/2020/06/12/march-for-us-2020-million-man-march-chicago/", "notes": "This 1-Million-Man-March in Chicago, IL…. is FOR US!Let’s Rise Up Together & March on Juneteenth (June 19th), the oldest nationally celebrated commemoration of the ending of slavery in the United States.Let Them Hear Us, Let Them See Us! Injustice Anywhere Is Injustice Everywhere! Share This Page & This Cause!", "epoch_time": 1592564400}, "geometry": {"type": "Point", "coordinates": [-87.6297982, 41.8781136]}}, {"type": "Feature", "properties": {"id": 30, "title": "ICE PROTEST", "time_info": "Friday, June 19 2020 at 04:00 PM", "latitude": "41.8753426", "longitude": "-87.6310491", "location": "Immigration and Customs Enforcement, 101 W Congress Pkwy Fl 4, Chicago,", "url": "https://www.protestchicago.com/2020/06/10/ice-protest/", "notes": "We can’t forget about the children. Let’s join together and use our voice to make a change. CHILDREN are getting molested under FEDERAL LAW. THIS IS A CRIMEThe government says they can’t do anything. THEY KNOW children are getting molested and won’t do anything.Worst of all since ICE isn’t getting to much attention at this moment they’ve been given the chance to do several more illegal stuff since they’re not under the spotlight.-March route will be announced soon.-DATE WILL BE UPDATED SOON. I realize I did set the date to June 19th which is also called Juneteenth which is a very important date as well. Our team is also holding a virtual event for Juneteenth. Celebrating and talking about the history. Message me for more information.-We want everyone to be safe during this protest. We are gathering permits, police officers, insurance, and paramedics in case anything happens. Your health and safety is really important to us.-We are as well contacting BLM/Immigration organization who are willing to help and join us.Again, your safety and health comes first.", "epoch_time": 1592582400}, "geometry": {"type": "Point", "coordinates": [-87.6310491, 41.8753426]}}, {"type": "Feature", "properties": {"id": 29, "title": "Chicago Peace And Equality Juneteenth Rally & Celebration 2020", "time_info": "Friday, June 19 2020 at 06:00 PM", "latitude": "41.8667185", "longitude": "-87.6289961", "location": "South Loop Green Space 2400 S. State St Chicago, IL.", "url": "https://www.protestchicago.com/2020/06/09/chicago-peace-equality-juneteenth-march/", "notes": "As we are in a movement of change in America we organized this march for several reasons under the umbrella of EQAULITY.\n1. Defunding of CPD\n2. Creation of CPAC (Civilian Police Accountability Council)\n3. Police Brutality\n4. Celebrate Black Independence From Slavery\n5. Justice for ALL Black lives lost to police brutality\n6. Education and Job Resources In the Black Community", "epoch_time": 1592589600}, "geometry": {"type": "Point", "coordinates": [-87.6289961, 41.8667185]}}, {"type": "Feature", "properties": {"id": 28, "title": "Defund the Cook County Jail!", "time_info": "Thursday, June 18 2020 at 09:30 AM", "latitude": "41.8426106", "longitude": "-87.6953025", "location": "2700 S California Ave, Chicago, IL 60608", "url": "https://www.protestchicago.com/2020/06/12/defund-the-cook-county-jail/", "notes": "Cook County spends more than $600 million each year supporting a racist system of policing and incarceration through the Cook County Sheriff’s budget, which includes sheriff’s police, the Cook County Jail, and more. Join us for a car caravan and socially distanced rally calling on the Cook County Board and President Toni Preckwinkle to defund the Cook County Jail and invest that money in Black communities. The County should spend its resources on the things that actually create community health and safety: housing, health care, mental health services, living wage jobs, public transportation, and restorative justice, instead of violent and racist policing and incarceration.", "epoch_time": 1592472600}, "geometry": {"type": "Point", "coordinates": [-87.6953025, 41.8426106]}}, {"type": "Feature", "properties": {"id": 27, "title": "March: The 39th ward demands Samantha Nugent support CPAC & BLM", "time_info": "Monday, June 15 2020 at 05:30 PM", "latitude": "41.9602844", "longitude": "-87.7289386", "location": "4380 N Elston Ave, Chicago, IL 60641", "url": "https://www.protestchicago.com/2020/06/12/march-the-39th-ward-demands-samantha-nugent-support-cpac-blm/", "notes": "Calling all residents of Old Irving Park, Mayfair, Albany Park, Sauganash, Forest Glen, and all neighborhoods of the 39th ward.The CPAC ordinance would create a Civilian Police Accountability Council in Chicago, which would take police oversight powers away from the mayor, and give it to an elected body of community members from police districts all over the city. It has been championed by a broad coalition of anti-racist and labor organizations organizing under the banner of the Chicago Alliance Against Racist and Political Repression.39th ward alderwoman Samantha Nugent is one of the holdouts on the city council standing in the way of progress. Despite attempts to convince her otherwise via calling and emailing, she continues to give milquetoast responses offering only lip service. It is time to show her that her constituents are serious and that Black Lives Matter. Our message will be loud and clear: Support CPAC.With their support, the march begins at the Muslim Community Center at 4380 N Elston. We will proceed north on Pulaski past the 17th district Chicago Police Department before heading west on Lawrence, ending at Samantha Nugent’s office at 4200 W Lawrence where we will stage a rally.Participants are urged to wear masks at all times. We want to amplify the voices and unite in solidarity of Black members of our communities. If you demonstrate any signs of hate speech, inciting violence, harassment of attendees, or destruction, you will be asked to leave.", "epoch_time": 1592242200}, "geometry": {"type": "Point", "coordinates": [-87.7289386, 41.9602844]}}]}