{"type": "FeatureCollection", "features": [{"type": "Feature", "properties": {"id": 1, "title": "Lincoln Square is Standing with Black Lives Matter-Safe Protest", "time_info": "June 7, 2020 - 4:30 PM – 5:30 PM", "latitude": "41.9631819", "longitude": "-87.6849975", "location": "Lincoln Ave and Sunnyside, Lincoln Square, Chicago, IL", "url": "https://www.protestchicago.com/2020/06/04/lincoln-square-is-standing-with-black-lives-matter-safe-protest/", "notes": "Have you wanted to be part of the upwelling of righteous protest against police brutality and senseless racist killing that has been happening across the city and the country, but didn’t want to risk your health or safety? This is your chance to do that: a quiet, socially-distanced display of our concern and anguish and our demand for change, happening here in our own neighborhood.We…1)Stand in solidarity with Black Lives Matters2)Demand justice for George Floyd, Breanna Taylor, and Ahmaud Arbery & all other victims.3)Demand a stop to police attacks on protesters4)Immediate accountability for the officers involved in the attack on two Black women in the Brickyard Mall on May 31st.Starting at the SW corner of Lincoln Ave and Sunnyside (across the street from Gideon Welles), protesters will social distance 6 – 10’ apart with the goal to ring Welles Park facing the street with our signs (preferably with messages on both sides). We don’t plan on chanting as that raises the risk for spreading Covid. A silent protest is powerful. We do not plan to march.For those who are higher risk for Covid or are concerned about being around too many people, we encourage a car caravan around the park as well.All participants must wear masks and social distance. This is a peaceful action. We would love for families to attend and show their support. We do not support any violence or property destruction!", "epoch_time": 1591547400}, "geometry": {"type": "Point", "coordinates": [-87.6849975, 41.9631819]}}, {"type": "Feature", "properties": {"id": 2, "title": "Chatham Peace Walk & Food Giveaway", "time_info": "June 7, 2020 - 10 AM", "latitude": "41.7514615", "longitude": "-87.6049795", "location": "79th & Cottage, Chicago, Illinois 60619", "url": "https://www.protestchicago.com/2020/06/06/chatham-peace-walk-food-giveaway/", "notes": "It’s been noisy over here. We don’t have pharmacies or grocery stores. We have to travel 10-15 miles to get milk for our kids. People in Chatham are not used to what feels like dang near a food desert almost.Our motto at My Block My Hood My City is “Helping People, No Matter What”. That is why we are meeting the immediate need of the community and providing food for any resident that needs it.We’re assembling at 10am at 79th and Cottage Grove for a Peace Walk in solidarity with all of Chicago and the families broken by police violence.From 11:30 until food runs out we will be distributing meals to anyone that needs one at 7801 S. State St.We have partnered up with local community bank, Providence Bank, Greater Chatham Initiative, the Social Consult, D.O.P.E youth, Good Kids Mad City, Color of Change, Project I Am, and Girls Like Me. #JusticeForGeorgeFloydWe need EVERYONE to join us in their M3 gear, mask, and a heart full of love.", "epoch_time": 1591524000}, "geometry": {"type": "Point", "coordinates": [-87.6049795, 41.7514615]}}, {"type": "Feature", "properties": {"id": 3, "title": "Protest for George Floyd & Against UCPD", "time_info": "June 7, 2020 - 3PM", "latitude": "41.784163", "longitude": "-87.5970735", "location": "1156 E 61st St, Chicago, IL 60637, United States", "url": "https://www.protestchicago.com/2020/06/06/protest-for-george-floyd-against-ucpd/", "notes": "The Reparations at UChicago Working Group, Good Kids Mad City, and other partner organizations will come together June 7th at 3:00pm, on the Woodlawn Residential Commons, to march, calling for the disbanding of UCPD and reparations. Please join us.", "epoch_time": 1591542000}, "geometry": {"type": "Point", "coordinates": [-87.5970735, 41.784163]}}, {"type": "Feature", "properties": {"id": 4, "title": "Press Conference and Front-line Worker Speak Out", "time_info": "June 8, 2020 - 12 PM - 1 PM", "latitude": "41.8787033", "longitude": "-87.6289318", "location": "Dirksen Federal Building, 219 S Dearborn St, Chicago, Illinois 60604", "url": "https://www.protestchicago.com/2020/06/04/press-conference-and-front-line-worker-speak-out/", "notes": "We will be holding a (socially distanced) press conference and public speak-out at the Dirksen Federal Building, noon on Monday, June 8, 2020.Workers will be announcing legal charges against the Chicago Transit Authority (CTA) for breaking worker’s First Amendment rights to freedom of speech. CTA management illegally broke up workers meetings discussing the safety and ethics of driving “police shuttles” which are being used to transport police and National Guard to demonstrations opposing the racist police murder of George Floyd.Please join us to defend workers’ rights to freedom of speech and right to oppose police murder. Front-line workers, such as nurses, grocery, big box, postal and delivery workers are especially welcome to speak out with us.", "epoch_time": 1591617600}, "geometry": {"type": "Point", "coordinates": [-87.6289318, 41.8787033]}}, {"type": "Feature", "properties": {"id": 5, "title": "Black Lives Matter", "time_info": "June 21, 2020 - 5 PM", "latitude": "41.8781", "longitude": "-87.6298", "location": "", "url": "https://www.protestchicago.com/2020/06/01/black-lives-matter/", "notes": "Comrades, we are not organizers, we started this page to amplify and promote existing protests organized by progressive leaders. Things are moving fast right now, and we have had submissions from individuals that could not be verified. We will continue to post protests that are publicly available.", "epoch_time": 1592758800}, "geometry": {"type": "Point", "coordinates": [-87.6298, 41.8781]}}, {"type": "Feature", "properties": {"id": 6, "title": "All Protest Publishing Suspended Until Further Notice", "time_info": "August 1, 2020 - 5 PM", "latitude": "41.8781", "longitude": "-87.6298", "location": "", "url": "https://www.protestchicago.com/2020/03/14/all-protest-publishing-suspended-until-further-notice/", "notes": "NOTE: We are making exceptions due to exceptional circumstances. Please protect yourself and the community from COVID 19 exposure.", "epoch_time": 1596301200}, "geometry": {"type": "Point", "coordinates": [-87.6298, 41.8781]}}]}