[{"id": 5, "title": "Black Lives Matter", "time_info": "June 21, 2020 - 5 PM", "latitude": "41.8781", "longitude": "-87.6298", "location": "", "url": "https://www.protestchicago.com/2020/06/01/black-lives-matter/", "notes": "Comrades, we are not organizers, we started this page to amplify and promote existing protests organized by progressive leaders. Things are moving fast right now, and we have had submissions from individuals that could not be verified. We will continue to post protests that are publicly available.", "epoch_time": 1592758800}, {"id": 6, "title": "All Protest Publishing Suspended Until Further Notice", "time_info": "August 1, 2020 - 5 PM", "latitude": "41.8781", "longitude": "-87.6298", "location": "", "url": "https://www.protestchicago.com/2020/03/14/all-protest-publishing-suspended-until-further-notice/", "notes": "NOTE: We are making exceptions due to exceptional circumstances. Please protect yourself and the community from COVID 19 exposure.", "epoch_time": 1596301200}, {"id": 9, "title": "DIVEST DEPAUL", "time_info": "Wednesday, June 10 2020 at 05:00 PM", "latitude": "41.9247378", "longitude": "-87.6562146", "location": "DePaul Quad, 2325 N Seminary Ave, Chicago", "url": "https://www.protestchicago.com/2020/06/09/divest-depaul/", "notes": "Join us at DePaul University Lincoln Park Campus’s Quad on June 10th to demand that DePaul University Divest From CPD and in solidarity with the Black Lives Matter and Defund CPD movement.2325 N Seminary Ave!!!White folks please come prepared to stand between cops and people of color!!!DePaul boasts itself as a beacon of interracial solidarity yet still profits off the prison industrial complex which disproportionally targets students of color by funding the education of Chicago police officers, working with the Fraternal Order of Police, allowing ICE on campus and refusing to support the BDS (boycott, divest, and sanction) movement.When DePaul students have tried to take action against the university in the past we have been silenced by the administration which last week called SWAT on students who protested for black lives in the wake of the George Floyd and Breonna Taylor killings at the hands of police.We stand with the greater movement to defund, disarm and disband the police and that is why we are demanding that DePaul no longer allows CPD to harass and terrorize vulnerable students who have to face the same sorts of oppression in their own neighborhoods.WE DEMAND THAT DEPAUL UNIVERSITY-End its relationship with CPD and FOP-Pay laid off dining Chartwells workers-End investments in private prisons-Ban the Box-Refuse to cooperate with ICE-Become a Sanctuary Campus-Divest from Israeli Products-End the Student Resource Officer (SRO) program that puts cops in public schools!!Arrive at the DePaul Quad at 5pm!!CO SPONSORING ORGS (Preliminary)-DePaul Socialists-Students Against Incarceration-Chicago Area Peace Action DePaul-Campaign NonViolence DePaul", "epoch_time": 1591808400}, {"id": 10, "title": "Lightfoot’s Tent City", "time_info": "Thursday, June 11 2020 at 10:00 AM", "latitude": "41.7805677", "longitude": "-87.5890141", "location": "6300 S Blackstone Ave, Chicago, IL ", "url": "https://www.protestchicago.com/2020/06/09/lightfoots-tent-city/", "notes": "Join us at Lightfoot’s Tent City to DEMAND investment in Black lives and Black communities. As a Coalition, when we say #DefundThePolice, we mean housing for Black communities, we mean quality education for Black communities, we mean mental health and physical healthcare for Black communities, not racist police terror and brutality for Black communities.", "epoch_time": 1591869600}, {"id": 11, "title": "Hospitality Worker Car Caravan for Black Lives", "time_info": "Friday, June 12 2020 at 04:00 PM", "latitude": "41.8399244", "longitude": "-87.6208001", "location": "Dunbar Park, East 31st Street, Chicago, IL", "url": "https://www.protestchicago.com/2020/06/07/hospitality-worker-car-caravan-for-black-lives/", "notes": "Join Unite Here Local 1 as we caravan in solidarity with the movement for black lives! Black Lives Matter!!!We will meet at 4PM at Dunbar Park (the corner of E. 29th St and Indiana Ave, Chicago, IL)Bring your car, signs and wear your mask!", "epoch_time": 1591977600}, {"id": 12, "title": "End Lakeview Racism: Demand Tom Tunney Support CPAC", "time_info": "Friday, June 12 2020 at 05:00 PM", "latitude": "41.9471669", "longitude": "-87.6509451", "location": "LakeView Lutheran Church 835 W Addison St, Chicago, IL", "url": "https://www.protestchicago.com/2020/06/07/end-lakeview-racism-demand-tom-tunney-support-cpac/", "notes": "WWW.ENDLAKEVIEWRACISM.COMDate: Friday, June 12thTime: 5 PMLocation: Lakeview Lutheran Church, 835 W Addison (Directly across from District 19 Police Department)Route: Police Department to Tom Tunney’s Office & More!!​Currently 19 Alderpeople support the Civilian Police Accountability Council (CPAC), which will create a democratically-elected council to oversee the Chicago Police Department. This is the first step in achieving safety and accountability for our black neighbors. We only need 7 more Aldermen to stop withholding their support.​​Alderman Tom Tunney (44th Ward) and Michele Smith (43rd ward) are two of them. They currently do not support CPAC, instead favoring GAPA (“Grassroots” Alliance for Police Accountability.) GAPA keeps the power with the Mayor and the police, leaving your black neighbors vulnerable to police officers like Officer David Diaz and Mike Pulaski. (For full story see: EndLakeviewRacism.Com )​Following George Floyd’s murder many Lakeview Neighbors have emailed Tom Tunny to plead with him to support the CPAC. On Friday June 5th, Tunney doubled down and remained a supporter of GAPA. It is time to make our voices heard. March with us.​If you cannot join our protest:Call and demand he support this initiative immediately: (773) 525-6034​​Email him using the following template:To the Alderman________, my name is ________ and I live at _________. I am writing you pleading for you to support CPAC – the Civilian Police Accountability Council, I am certain I do not have to explain to you the severe relevance and urgent need for your support on the enactment of this ordinance that would create a democratically-elected council to oversee CPD. Black and brown lives literally depend on your help. We only need 7 more alderpeople to support the CPAC in order for it to pass! Please be on the right side of history here. This is one small step towards ending the pandemic of racist police brutality and allowing citizens to hold officers accountable. Your community is demanding that you support CPAC and that you encourage your fellow alderpeople to support it, as well. We are counting on you! Best, __________ward44@cityofchicago.org", "epoch_time": 1591981200}, {"id": 13, "title": "Portage and Jefferson Parks Unite for Black Lives", "time_info": "Friday, June 12 2020 at 05:00 PM", "latitude": "41.9675301", "longitude": "-87.7636294", "location": "5425 W Lawrence Ave, Chicago, IL", "url": "https://www.protestchicago.com/2020/06/09/portage-and-jefferson-parks-unite-for-black-lives/", "notes": "For too long, Black people in our community, in our city and in our country have suffered violence and brutality at the hands of police and our systems of government. Please join neighbors in Portage Park and Jefferson Park for a demonstration in support of Black Lives and against racism.We unite in solidarity, but also to hold our alderman accountable.Alderman Jim Gardiner has said nothing regarding the murder of George Floyd, Breonna Taylor, Tony McDade, or other Black people who have been killed by police or white supremacists in recent months. He has remained silent on where he stands on CPAC, a proposed ordinance that would empower communities to hold our police system accountable. He has shown that he is unwilling to speak up on behalf of ALL of his constituents.We demand that Ald. Gardiner address these murders. We demand that Ald. Gardiner comes out against police brutality. We demand that Ald. Gardiner say their names.We will start at 45th Ward Alderman Jim Gardiner’s Office for a brief rally followed by a march to the 16th Precinct CPD headquarters at 5151 N. Milwaukee. To facilitate safer, socially distanced participation in the demonstration, we are urging all participants to wear masks for the entire event. There will also be a car caravan that follows marchers after the rally to the 16th precinct headquarters.This will be a peaceful protest. We want to amplify the voices and unite in solidarity of Black members of our communities. If you demonstrate any signs of hate speech, inciting violence, harassment of attendees, or destruction, you will be asked to leave.Stay tuned for details in the discussion section.", "epoch_time": 1591981200}, {"id": 14, "title": "Justice 4 George Floyd + Breonna Taylor, Defund CPD: NW Side Chi", "time_info": "Saturday, June 13 2020 at 02:00 PM", "latitude": "41.9717333", "longitude": "-87.763504", "location": "Jefferson Park (near metra stop/blue line station) exact start TBD", "url": "https://www.protestchicago.com/2020/06/09/justice-4-george-floyd-breonna-taylor-defund-cpd-nw-side-chi/", "notes": "**STARTING LOCATION TO BE ANNOUNCED LATER THIS WEEK**", "epoch_time": 1592056800}]