[{"id": 1, "title": "Black Jews for Black Lives: Shabbat Gathering with Kol Or", "time_info": "June 5, 2020 - 5:30 PM – 6:15 PM", "latitude": "0.0", "longitude": "0.0", "location": "Union Park, 1501 W Randolph St, Chicago, IL 60606", "url": "https://www.protestchicago.com/2020/06/03/black-jews-for-black-lives-shabbat-gathering-with-kol-or/", "notes": "EVENT UPDATE:In hearing from our partners in the Right to Recovery coalition, and in seeing the shifts happening with who is leading and how Saturday’s protest is being planned, we are changing our Black Jews for Black Lives gathering to Friday, June 5 at 5:30 pm in Union Park to align with BLM Chicago’s Defund CPD: Fund Black Lives march.We will meet at 5:30 just south of the tennis courts in Union Park, along Washington Blvd. We will gather (as socially distanced as folks feel comfortable), sing (with masks on), hear testimony from members of Kol Or, and join the march together at 6:00 pm.The JCUA program will be from 5:45-6:15 and then weUnion Park is off the Ashland bus and the Ashland Green and Pink Line stop. We recommend if you are driving to park a few blocks away so your car is able to get out once the march starts.We will be live-streaming the event on the JCUA Facebook.At this time we will have a contingent but we are not part of organizing the larger event. Recommendations: wear your mask, bring water. Leave your vehicle outside the perimeter of the park because we don’t know if the park will be closed off following the event.EVENT DESCRIPTION:Join us this Friday for a “Black Jews for Black Lives Shabbat Gathering” led by JCUA’s Kol Or caucus for Jews of Color, taking place at in Union Park before the BLM Chicago’s Defund CPD: Fund Black Lives march. There will be song, prayer, and reflection. Black Jews need your allyship and support as we seek justice for George Floyd and dismantle white supremacy and defund the police. We will then join the march together. If your Shabbat practice allows, we’re calling on you to join us.SAFETY PLAN:We hope Saturday will be a peaceful, grounding morning. We will have marshalls clearly designated with orange vests carrying backpacks of supplies, and individuals prepared to be de-escalators and on cop watch. If you need assistance at all during the morning, please reach out to a marshall or someone on JCUA staff.For those who are able to come out, see ya there! For those who are not, we still see you ♥RSVP form here: https://docs.google.com/forms/d/e/1FAIpQLSe0LzlpYiShq8JMwWbxyexX1Ids-yyDPaQWhG1th4vuEXecrw/viewform?usp=sf_link.Here is the Facebook event for Friday’s Action: https://www.facebook.com/events/303528150668758/Read our joint-statement by Kol Or and our White Working Group here: https://medium.com/jewish-council-on-urban-affairs/joint-statement-from-jcuas-white-racial-justice-working-group-and-kol-or-caucus-for-jews-of-color-e5c5d51cf4e4"}, {"id": 2, "title": "Defund CPD: Fund Black Lives!", "time_info": "June 5, 2020 - 6 PM", "latitude": "0.0", "longitude": "0.0", "location": "Union Park Chicago, Illinois", "url": "https://www.protestchicago.com/2020/06/04/defund-cpd-fund-black-lives/", "notes": "Meet Union Park at 6pm. Exact in the park location announced the day of the event.Before COVID, before George Floyd, and well after: Mayor Lori Lightfoot has encouraged and engendered violence against Black, Latinx, immigrant neighborhoods.The Chicago Police have beat us and harassed us in our own neighborhoods before our protests and now are using our demonstrations to use military violence against us. NO MORE!WE DEMAND:– Defund and demilitarize the police– CPD and National Guard stand down IMMEDIATELY– End the Curfew– Release all protesters– Redirect CPD funds to schools, PPE equipment, COVID testing, and rent relief– Civilian Police Accountability Council (CPAC) nowArrive at Union Park at 6:00pmRally at 6:30pmCO-SPONSORING ORGANIZATIONS (PRELIMINARY LIST):– BLM Chicago– AfroSocialist + Socialists of Color Caucus– Chicago DSA– 33rd Ward Working Families– Logan Square Mutual Aid– DePaul Socialists– United Neighbors of the 35th Ward– 50th Ward Working Families– Chicago Feminist Action"}, {"id": 3, "title": "Say Her Name: Breonna Taylor", "time_info": "June 5, 2020 - 2 PM – 6 PM", "latitude": "0.0", "longitude": "0.0", "location": "The Riviera Theatre, 4746 N Racine Ave, Chicago, Illinois 60640", "url": "https://www.protestchicago.com/2020/06/04/say-her-name-breonna-taylor/", "notes": "June 5th 2020, Breonna Taylor would’ve turned 26.Breonna Taylor was a exceptional EMT worker, her job was to show up and make sure people were taken care of, so why haven’t we done the same for her? This day is going to be to collectively mourn, support, and celebrate Breonna Taylor. Her and black womxn everywhere.Far too often, Black Womxn are the ones leading these movements for change, demanding justice and equality, but are easily forgotten when it’s time for us to be represented.Too often, black womxn are loved in the shadows instead of outloud. Too many times, we are seen as the blueprint for culture, movements, humanity itself, and yet, we are not respected. We are discarded and forgotten and our cries are ignored. This narrative needs to change. We deserve to be seen, heard and loved, consistently & unconditionallyPlease note; We’re peacefully protesting and not enticing violence during this march. We will be LOUD! We will be giving Breonna the attention she deserves on her birthday!! We will be demanding justice for her and to bring her killers to jail!!Along with our being peaceful, we will also use this time to act. As a collective, there are several ways to bring Breonna justice. We will participate in doing that this & every day for the black womxn we see around us, know & love.—We will be organizing at the circular art piece next to The Riviera at 1:30PM and making our way down @ 2PM~ Please be sure to walk with a buddy and keep a mask on you face too!We will have volunteers passing out snacks, hand sanitizer, water and other supplies too.If you want to volunteer to assist as liaison for when we turn street/corners or supply providers, please contact host via DM"}, {"id": 4, "title": "Chicago March of Justice for George Floyd", "time_info": "June 6, 2020 - 11 AM", "latitude": "0.0", "longitude": "0.0", "location": "Union Park, 1501 W Randolph St, Chicago, IL 60606", "url": "https://www.protestchicago.com/2020/06/01/chicago-march-of-justice-for-george-floyd/", "notes": "This event is being planned by Activate: Chicagohttps://bit.ly/ActivateChiWe will march to end Police BrutalityWe will march because #blacklivesmatterWe march for justice for George Floyd and his FamilyThis march will be peacefulUnion Park is where we will meetwe start the protest here as a sit down protestfists in the airchanting love conquers allblack lives matterwe want justice we want peacelet freedom ringhere we will kick off our protest with those who would like to read poems or motivational speechesstay unitedstay peacefulstay safePlease wear your maskI’ve looked into this and where we are gathering for the march is completely legal and in a spot where you do not need a permit to protest ! please remember these are peaceful demonstrationssigns and mantras will doif you intend on destroying public property please know that is illegal and you will face the consequences per city of Chicagoif you plan on rioting do NOT attend this event it should be 100% PEACEFUL!!!!! AS THAT IS MY INTENTNO LITTERING bring garbage bagsi want us all to be as safe and educated as possible! and keep our city clean and intact as we show our solidarity"}, {"id": 5, "title": "Walk To Recognize Racism", "time_info": "June 6, 2020 - 10 AM – 11 AM", "latitude": "0.0", "longitude": "0.0", "location": "Central Avenue & Hiawatha, Chicago", "url": "https://www.protestchicago.com/2020/06/04/walk-to-recognize-racism/", "notes": "Dear Community Leaders and Friends,Thank you all for joining a WALK TO RECOGNIZE RACISM, a peaceful march for our NW Chicago and Neighboring communities. Our journey begins at 10am, Saturday morning at Edgebrook Elementary School and will end at Wildwood Elementary School. At our arrival there will be a moment of reflection and music.This is a chance for us to begin the process and do the work. All families are welcome. Our goal is to end the divide and stand as a community.All of our neighboring communities are welcome to peacefully stand up against racism, please extend our heartfelt invitation."}, {"id": 6, "title": "United Against Racism & Police Violence/ Unidos contra el racismo y violencia policial", "time_info": "June 6, 2020 - 10:30 AM", "latitude": "0.0", "longitude": "0.0", "location": "Two Feeder Caravans/Marches, starting at: Kelly HS (2725 W 41st St) and Harper HS (6520 S Wood St)", "url": "https://www.protestchicago.com/2020/06/05/united-against-racism-police-violence-unidos-contra-el-racismo-y-violencia-policial/", "notes": "During these times, we must demonstrate a united front against racism and police violence. Join community members from the Southside of Chicago in a March and Caravan towards #PoliceFreeSchools.Únase a miembros de la comunidad el sur de Chicago en marcha y caravana para #EscuelasLibresDePolicias.Gather at 10:30 a.m., Program at 11:00 a.m., Caravan/March FollowsDemands:-Cancel CPD contract with CPS-Fund restorative practices in all schools-Additional social workers and student support personnel in our schools-Civilian Police Accountability Council for Chicago-Support the Right to Recovery legislative package-Make all schools Sustainable Community Schools*****Two feeder caravan/march staging points:Kelly HS, 4136 S. California Ave. (cars can gather/park in lot)Harper HS, 6520 S. Wood*****We are asking that everyone wear masks and continue to practice social distancing."}, {"id": 7, "title": "Humboldt Park Unity For BLM", "time_info": "June 6, 2020 - 6 PM", "latitude": "0.0", "longitude": "0.0", "location": "Division & Western Chicago, Illinois 60622", "url": "https://www.protestchicago.com/2020/06/05/humboldt-park-unity-for-blm/", "notes": "It’s time we take a stand as people we will not tolerate anti blackness in our neighborhoods. We know there are more of you out there. Please don’t feel afraid to come out and support. We need to be more visible and vocal then a few wanting to divide black and brown people. Saturday at 6pm in Humboldt Park. If you can’t come please continue to have conversations about anti blackness with your family. Sometimes it’s just hard to find the words pero Si Se Puede. Your presence is valuable, be the change. See you on the frontlines. Come one… come all ✊🏽🙏🏽🖤 🤎 #BLM #BrownPeopleForBlackPower*Please wear a mask* We will have disposable ones if you need one. Thanks"}, {"id": 8, "title": "Youth led Black & Brown Unity March: Justice for George Floyd", "time_info": "June 6, 2020 - 4 PM", "latitude": "0.0", "longitude": "0.0", "location": "4922 S Western Ave, Chicago, IL ", "url": "https://www.protestchicago.com/2020/06/05/youth-led-black-brown-unity-march-justice-for-george-floyd/", "notes": "🚨ENGLISH:As students from the south side of Chicago, we will not accept any type of racial division in our city. We understand that when the Black community is under attack, we must stand up & fight back hand in hand. The brown community stands with the Black community as they fight for #GeorgeFloyd, #BreonnaTaylor & the countless many lives taken by police offers across the United States of America.We are currently facing two viruses in this country: #COVID19 and racism. We will make sure to make everyone’s health & safety a priority by reminding folks to wear a mask & social distance as much as possible.***This will be a peaceful action & we ask that folks come in peace. We do NOT condone any type of property damage done to our local community businesses.————————————————————————🚨Español:Como estudiantes del sur de Chicago, no aceptáremos ningún tipo de división racial en nuestra ciudad. Entendemos que cuando la comunidad negra está bajo ataque, debemos ponernos de pie y luchar de la mano. La comunidad hispana respalda a la comunidad negra mientras luchan por #GeorgeFloyd, #BreonnaTaylor y las innumerables vidas que la policía se ha llevado a través de los Estados Unidos de América.Actualmente nos enfrentamos a dos virus en este país: #COVID19 y el racismo. Nos aseguraremos de que la salud y la seguridad de todos sean una prioridad al recordarles a las personas que usen una máscara y distancia social tanto como sea posible.***Esta será una acción pacífica y pedimos que la gente venga en paz. NO aprobamos de ningún tipo de daño a nuestros negocios comunitarios locales."}, {"id": 9, "title": "Lincoln Square is Standing with Black Lives Matter-Safe Protest", "time_info": "June 7, 2020 - 4:30 PM – 5:30 PM", "latitude": "0.0", "longitude": "0.0", "location": "Lincoln Ave and Sunnyside, Lincoln Square, Chicago, IL", "url": "https://www.protestchicago.com/2020/06/04/lincoln-square-is-standing-with-black-lives-matter-safe-protest/", "notes": "Have you wanted to be part of the upwelling of righteous protest against police brutality and senseless racist killing that has been happening across the city and the country, but didn’t want to risk your health or safety? This is your chance to do that: a quiet, socially-distanced display of our concern and anguish and our demand for change, happening here in our own neighborhood.We…1)Stand in solidarity with Black Lives Matters2)Demand justice for George Floyd, Breanna Taylor, and Ahmaud Arbery & all other victims.3)Demand a stop to police attacks on protesters4)Immediate accountability for the officers involved in the attack on two Black women in the Brickyard Mall on May 31st.Starting at the SW corner of Lincoln Ave and Sunnyside (across the street from Gideon Welles), protesters will social distance 6 – 10’ apart with the goal to ring Welles Park facing the street with our signs (preferably with messages on both sides). We don’t plan on chanting as that raises the risk for spreading Covid. A silent protest is powerful. We do not plan to march.For those who are higher risk for Covid or are concerned about being around too many people, we encourage a car caravan around the park as well.All participants must wear masks and social distance. This is a peaceful action. We would love for families to attend and show their support. We do not support any violence or property destruction!"}, {"id": 10, "title": "Press Conference and Front-line Worker Speak Out", "time_info": "June 8, 2020 - 12 PM - 1 PM", "latitude": "0.0", "longitude": "0.0", "location": "Dirksen Federal Building, 219 S Dearborn St, Chicago, Illinois 60604", "url": "https://www.protestchicago.com/2020/06/04/press-conference-and-front-line-worker-speak-out/", "notes": "We will be holding a (socially distanced) press conference and public speak-out at the Dirksen Federal Building, noon on Monday, June 8, 2020.Workers will be announcing legal charges against the Chicago Transit Authority (CTA) for breaking worker’s First Amendment rights to freedom of speech. CTA management illegally broke up workers meetings discussing the safety and ethics of driving “police shuttles” which are being used to transport police and National Guard to demonstrations opposing the racist police murder of George Floyd.Please join us to defend workers’ rights to freedom of speech and right to oppose police murder. Front-line workers, such as nurses, grocery, big box, postal and delivery workers are especially welcome to speak out with us."}, {"id": 11, "title": "Black Lives Matter", "time_info": "June 21, 2020 - 5 PM", "latitude": "0.0", "longitude": "0.0", "location": "", "url": "https://www.protestchicago.com/2020/06/01/black-lives-matter/", "notes": "Comrades, we are not organizers, we started this page to amplify and promote existing protests organized by progressive leaders. Things are moving fast right now, and we have had submissions from individuals that could not be verified. We will continue to post protests that are publicly available."}, {"id": 12, "title": "All Protest Publishing Suspended Until Further Notice", "time_info": "August 1, 2020 - 5 PM", "latitude": "0.0", "longitude": "0.0", "location": "", "url": "https://www.protestchicago.com/2020/03/14/all-protest-publishing-suspended-until-further-notice/", "notes": "NOTE: We are making exceptions due to exceptional circumstances. Please protect yourself and the community from COVID 19 exposure."}]