[{"id": 5, "title": "Black Lives Matter", "time_info": "June 21, 2020 - 5 PM", "latitude": "41.8781", "longitude": "-87.6298", "location": "", "url": "https://www.protestchicago.com/2020/06/01/black-lives-matter/", "notes": "Comrades, we are not organizers, we started this page to amplify and promote existing protests organized by progressive leaders. Things are moving fast right now, and we have had submissions from individuals that could not be verified. We will continue to post protests that are publicly available.", "epoch_time": 1592758800}, {"id": 6, "title": "All Protest Publishing Suspended Until Further Notice", "time_info": "August 1, 2020 - 5 PM", "latitude": "41.8781", "longitude": "-87.6298", "location": "", "url": "https://www.protestchicago.com/2020/03/14/all-protest-publishing-suspended-until-further-notice/", "notes": "NOTE: We are making exceptions due to exceptional circumstances. Please protect yourself and the community from COVID 19 exposure.", "epoch_time": 1596301200}, {"id": 23, "title": "Drag March For Change", "time_info": "Sunday, June 14 2020 at 05:00 PM", "latitude": "41.940138", "longitude": "-87.649422", "location": "Boystown, 800 W Belmont Ave, Chicago, Illinois", "url": "https://www.protestchicago.com/2020/06/10/drag-march-for-change/", "notes": "Join Drag Queens, Kings, and everyone in between as they lead a peaceful (non-violent) protest march in support of Black Lives Matter and demand justice for victims of police brutality and excessive force through the Boystown community in Lakeview Chicago with gathering beginning at 4:30 pm at Belmont and Halsted with the march beginning at 5:00 pm and ending at Halsted and Grace where drag community leaders will speak on the issues of today, the mission at hand, and ways to create and promote lasting impactful change for a better future for all. #BlackLivesMatter-This is a peaceful protest-You do not need to be in Drag to attend (allies are welcome)-PPE (Masks) are very much encouraged-If you would like to help please reach out to jomamasayshi@gmail.com-Volunteer Sign Up Sheethttps://forms.gle/q4yUTpwZc28cd29aAWe Demand:-Justice* for Tony McDade-Justice* for Breonna Taylor-Justice* for George Floyd-Reclassification of violence against Trans individuals as a hate crime-Civilian Police Accountability Council (CPAC) now!-Immediate release of all protesters-Acknowledgement that black lives matter from all levels of government. Specifically the executive branch of the federal government.*Justice being the immediate arrest and following indictments of all officers whose actions resulted in these unjustified deaths.For this to be successful, it is very important that everyone stay on message, peaceful, and deescalate any situation.Also please wear your face masks (if you produce them please bring some for others), and please bring hand sanitizer.The opening paragraph was written with the intentional handling of punctuation to force an examination of current power structures and their ability to still function after remodeling, along with forcing the viewer to read the content in one breath. One breath the victims of police brutality will never get to take again.Official list of Speakers:Lucy Stoole- Drag Queen of the Year and Bearded BeautyShea Couleé- RuPaul’s Drag Race Season 9 and All Stars 5The Vixen- Black Girl Magic coordinator and RuPaul’s Drag Race Season 10Lúc Ami- Distinguished Drag KingMiss Toto- Chicago’s Premier Body Building Drag QueenDida Ritz- RuPaul’s Drag Race Season 4Zola- Accomplished ActivistJazmine Salas- co chair, Chicago Alliance Against Racist and Political RepressionZahara Bassett- Director of Development for the Brave Space AllianceTatyana Chante- Accomplished ActivistJo Mama- Event organizer and leader", "epoch_time": 1592154000}, {"id": 24, "title": "Graduates March #CopsOutCPS #DefundPolice", "time_info": "Sunday, June 14 2020 at 12:30 PM", "latitude": "41.7821025", "longitude": "-87.5870796", "location": "6220 S Stony Island Ave, Chicago, IL", "url": "https://www.protestchicago.com/2020/06/12/graduates-march-copsoutcps-defundpolice/", "notes": "Join recent CPS Graduates and allies as we March to demand #CPDoutCPS and #DefundPolice.We’re asking Graduates to wear caps and gowns.This March coincides with the Mayor’s Virtual Graduation Ceremony with Oprah Winfrey.", "epoch_time": 1592137800}, {"id": 25, "title": "East Side BLM Solidarity March", "time_info": "Sunday, June 14 2020 at 03:00 PM", "latitude": "41.7131471", "longitude": "-87.5355636", "location": "10049 S Indianapolis Ave, Chicago, IL 60617", "url": "https://www.protestchicago.com/2020/06/12/east-side-blm-solidarity-march/", "notes": "Following the protests and the march in South Chicago we are hosting a community action aimed to build community and learn how we can all be in solidarity with Black folx and the Black Lives Matter movement! We invite community members from all over the Southeast Side (East Side, South Chicago, South Deering & Hegewisch) to come march, talk, build and grow together.Inviting everyone to come out! We do not expect people to be experts!! We aim to create an inclusive space where we can all learn together as a community. We do not expect this to happen overnight and hope we are able to spark conversation and actions so that Southeast siders can not only CHANT “BLACK LIVES MATTER” but MEAN it through community actions and support.We want to create a non-judgmental space for people of all backgrounds to come and learn from one another. However because we are learning about how we can support Black folx and the Black Lives Matters movement, any racist/anti-blackness or any form of discrimination towards people of color will not be tolerated! We want people to come learn and join the conversation but not at the expense of continuing to hurt Black folx or people of color. IT STOPS HERE! NO MASWe want to provide a platform to encourage Black people affiliated with Black organizations/groups or Black Chicagoans who are particularly touched by the movement and would like to share. Sign up -here- for a slot to speak at the community action and we will follow up with details!Calling all bikers, skateboarders, scootersCalling families and kidsCalling young people/leaders/activists———–¡Siguiendo las protestas y la marcha en Sur Chicago, estamos organizando una acción comunitaria destinada a reforzar comunidad y aprender cómo podemos ser solidarios con afroestadounidenses y el movimiento Black Lives Matter! Invitamos a los miembros de la comunidad de todo el lado sureste (East Side, Sur Chicago, Sur Deering y Hegewisch) para que podemos marchar, hablar, construir y crecer juntos.¡Invitando a todos a salir! ¡No esperamos que sean expertos! Nuestro objetivo es crear un espacio inclusivo donde todos podamos aprender juntos como comunidad. No esperamos que esto suceda en un dia y esperamos ser capaces de inspirar conversaciones y acciones para que nuestra comunidad del Sudeste Chicago no solo puedan GRITAR “LAS VIDAS NEGRAS IMPORTAN” sino también lo CONFIRMALO con nuestras acciones y apoyo.Queremos crear un espacio sin prejuicios para que personas de todos orígenes vengan y aprendan unas de otras. Sin embargo, debido a que estamos aprendiendo cómo podemos apoyar a afroestadounidenses y al movimiento Las Vidas Negras Importan No se tolerará ningún tipo de discriminación racista / anti-afroestadounidenses o cualquier forma de discriminación hacia las personas de color! Queremos que las personas vengan a aprender y unirse a la conversación, pero no a expensas de seguir lastimando a afroestadounidenses o personas de color. ¡Se termina aquí! ¡NO MAS!Queremos proporcionar una plataforma para elevar prespectivas afroestadounidenses afiliadas a organizaciones / grupos afroestadounidenses o afroestadounidenses en Chicago que están particularmente conmovidos por el movimiento y les gustaría compartir. Regístrese aquí para y tendrá un espacio para hablar en la acción comunitaria y le daremos seguimiento con detalles.¡Llamando a todos los ciclistas, patinetas!¡Llamando a familias y niños!¡Llamando a jóvenes!", "epoch_time": 1592146800}, {"id": 26, "title": "#BunkerBirthday for Trump – A 1-Way Ticker #OUTNOW", "time_info": "Sunday, June 14 2020 at 03:00 PM", "latitude": "41.9282412", "longitude": "-87.6342062", "location": "Lawn in Lincoln Park, near intersection of Diversey, N. Cannon Dr. and Sheridan Rd., Chicago", "url": "https://www.protestchicago.com/2020/06/12/bunkerbirthday-for-trump-a-1-way-ticker-outnow/", "notes": "As we continue to grieve and demand justice for George Floyd, Breonna Taylor, Ahmaud Arbery and all victims of police brutality, we are inspired by the movement for black lives and an end to police murder that drove Trump into his bunker. Let’s take it higher and put an end to the reign of the White Supremacist in the WH:", "epoch_time": 1592146800}, {"id": 27, "title": "March: The 39th ward demands Samantha Nugent support CPAC & BLM", "time_info": "Monday, June 15 2020 at 05:30 PM", "latitude": "41.9602844", "longitude": "-87.7289386", "location": "4380 N Elston Ave, Chicago, IL 60641", "url": "https://www.protestchicago.com/2020/06/12/march-the-39th-ward-demands-samantha-nugent-support-cpac-blm/", "notes": "Calling all residents of Old Irving Park, Mayfair, Albany Park, Sauganash, Forest Glen, and all neighborhoods of the 39th ward.The CPAC ordinance would create a Civilian Police Accountability Council in Chicago, which would take police oversight powers away from the mayor, and give it to an elected body of community members from police districts all over the city. It has been championed by a broad coalition of anti-racist and labor organizations organizing under the banner of the Chicago Alliance Against Racist and Political Repression.39th ward alderwoman Samantha Nugent is one of the holdouts on the city council standing in the way of progress. Despite attempts to convince her otherwise via calling and emailing, she continues to give milquetoast responses offering only lip service. It is time to show her that her constituents are serious and that Black Lives Matter. Our message will be loud and clear: Support CPAC.With their support, the march begins at the Muslim Community Center at 4380 N Elston. We will proceed north on Pulaski past the 17th district Chicago Police Department before heading west on Lawrence, ending at Samantha Nugent’s office at 4200 W Lawrence where we will stage a rally.Participants are urged to wear masks at all times. We want to amplify the voices and unite in solidarity of Black members of our communities. If you demonstrate any signs of hate speech, inciting violence, harassment of attendees, or destruction, you will be asked to leave.", "epoch_time": 1592242200}, {"id": 28, "title": "Defund the Cook County Jail!", "time_info": "Thursday, June 18 2020 at 09:30 AM", "latitude": "41.8426106", "longitude": "-87.6953025", "location": "2700 S California Ave, Chicago, IL 60608", "url": "https://www.protestchicago.com/2020/06/12/defund-the-cook-county-jail/", "notes": "Cook County spends more than $600 million each year supporting a racist system of policing and incarceration through the Cook County Sheriff’s budget, which includes sheriff’s police, the Cook County Jail, and more. Join us for a car caravan and socially distanced rally calling on the Cook County Board and President Toni Preckwinkle to defund the Cook County Jail and invest that money in Black communities. The County should spend its resources on the things that actually create community health and safety: housing, health care, mental health services, living wage jobs, public transportation, and restorative justice, instead of violent and racist policing and incarceration.", "epoch_time": 1592472600}, {"id": 29, "title": "Chicago Peace And Equality Juneteenth Rally & Celebration 2020", "time_info": "Friday, June 19 2020 at 06:00 PM", "latitude": "41.8667185", "longitude": "-87.6289961", "location": "South Loop Green Space 2400 S. State St Chicago, IL.", "url": "https://www.protestchicago.com/2020/06/09/chicago-peace-equality-juneteenth-march/", "notes": "As we are in a movement of change in America we organized this march for several reasons under the umbrella of EQAULITY.\n1. Defunding of CPD\n2. Creation of CPAC (Civilian Police Accountability Council)\n3. Police Brutality\n4. Celebrate Black Independence From Slavery\n5. Justice for ALL Black lives lost to police brutality\n6. Education and Job Resources In the Black Community", "epoch_time": 1592589600}, {"id": 30, "title": "ICE PROTEST", "time_info": "Friday, June 19 2020 at 04:00 PM", "latitude": "41.8753426", "longitude": "-87.6310491", "location": "Immigration and Customs Enforcement, 101 W Congress Pkwy Fl 4, Chicago,", "url": "https://www.protestchicago.com/2020/06/10/ice-protest/", "notes": "We can’t forget about the children. Let’s join together and use our voice to make a change. CHILDREN are getting molested under FEDERAL LAW. THIS IS A CRIMEThe government says they can’t do anything. THEY KNOW children are getting molested and won’t do anything.Worst of all since ICE isn’t getting to much attention at this moment they’ve been given the chance to do several more illegal stuff since they’re not under the spotlight.-March route will be announced soon.-DATE WILL BE UPDATED SOON. I realize I did set the date to June 19th which is also called Juneteenth which is a very important date as well. Our team is also holding a virtual event for Juneteenth. Celebrating and talking about the history. Message me for more information.-We want everyone to be safe during this protest. We are gathering permits, police officers, insurance, and paramedics in case anything happens. Your health and safety is really important to us.-We are as well contacting BLM/Immigration organization who are willing to help and join us.Again, your safety and health comes first.", "epoch_time": 1592582400}, {"id": 31, "title": "March For US 2020 – Million Man March, Chicago", "time_info": "Friday, June 19 2020 at 11:00 AM", "latitude": "41.8781136", "longitude": "-87.6297982", "location": "Chicago, IL", "url": "https://www.protestchicago.com/2020/06/12/march-for-us-2020-million-man-march-chicago/", "notes": "This 1-Million-Man-March in Chicago, IL…. is FOR US!Let’s Rise Up Together & March on Juneteenth (June 19th), the oldest nationally celebrated commemoration of the ending of slavery in the United States.Let Them Hear Us, Let Them See Us! Injustice Anywhere Is Injustice Everywhere! Share This Page & This Cause!", "epoch_time": 1592564400}, {"id": 32, "title": "Shift Chicago March/Gathering", "time_info": "Saturday, June 20 2020 at 11:00 AM", "latitude": "41.8781136", "longitude": "-87.6297982", "location": "Chicago, Illinois", "url": "https://www.protestchicago.com/2020/06/12/shift-chicago-march-gathering/", "notes": "Join thousands of individuals on June 20th, 2020 from around the Chicagoland area as take to the streets and let our voices be heard. Our objective is to voice our concerns, demand reconstruction in our justice system, educate others, love one another, contact legislators, and propose legislature. Remember this will be a peaceful march. Let’s make a change for our city!", "epoch_time": 1592650800}, {"id": 33, "title": "CHICAGO MUSICIAN MARCH FOR EQUALITY & CHANGE", "time_info": "Sunday, June 21 2020 at 10:00 AM", "latitude": "41.8781", "longitude": "-87.6298", "location": "Lincoln Park to Wicker Park, Chicago", "url": "https://www.protestchicago.com/2020/06/12/chicago-musician-march-for-equality-change/", "notes": "Join Chicago musicians, industry workers and friends of the Chicago music community, as they lead a peaceful (non-violent) protest march in support of Black Lives Matter and demand justice for victims of police brutality and excessive force. The march will begin gathering at 9:30AM in Lincoln Park at Julia Porter Park- the six corner intersection of Fullerton / Lincoln / Halsted, we will start walking at 10AM, and end at the six corner intersection of North / Milwaukee / Damen in Wicker Park.", "epoch_time": 1592733600}]